{"pageProps":{"job":{"slug":"luna","displayName":"LunaDNA","industries":["Healthcare","Life Sciences","Nonprofit","SaaS"],"platforms":["Web"],"link":"https://www.lunadna.com","description":"Public Benefit Corporation with platforms for Study Members, Community Admins, Survey Builders, and Researchers","logoUrl":"/images/logos/logo-luna.png","bgUrl":"/images/luna-my-data.png","bgColor":"#009899","role":"Lead Frontend Engineer","roleSummary":"As an early hire and Lead Frontend Engineer, I built the connected suite of web apps that comprised Luna's Member-Admin-Researcher product offering.<br /><br />I hired three frontend developers, and we all worked closely with our 3-person backend and 2-person devops teams to create a scalable, secure, and performant platform that served hundreds of thousands of users.<br /><br />Unfortunately, in the end Luna was unable to find a sustainable business model and was forced to shut down.","timeline":"2019 — 2024","projects":[{"slug":"member","displayName":"Luna Member","link":"https://member.lunadna.com","description":"Luna Members can share (with fine-grained privacy controls) DNA sequencing reports, Genetic Health Tests, health and lifestyle surveys, connected electronic health records (EHRs), and medical imaging and documentation.","achievements":["150k+ registered members","95% conversion rate from registration to consent","100k+ study members","30k+ DNA files uploaded","50k+ surveys completed","20k+ patient portals connected","300k+ EHRs synced"],"features":["OIDC identity authentication and policy-based access control (PBAC)","gRPC and WebRTC streaming API for video and audio survey responses","Redux store, query caching, and WebSocket connections for managing stateful user content","Feature flag-driven development methodologies","Error management and reporting","KPI and conversion tracking"],"technologies":["React",".NET","AWS"],"color":"teal","imageUrl":""},{"slug":"admin","displayName":"Luna Community Admin","link":"https://console.lunadna.com","description":"Luna Community Admins can create and manage Studies, Member Notifications, Referral campaigns, and more features.","technologies":["React",".NET","AWS"],"achievements":["100+ communities onboarded","500+ studies created"],"features":[],"color":"teal","imageUrl":""},{"slug":"survey","displayName":"Luna Survey Builder","link":"https://builder.survey.lunadna.com","description":"Luna Survey Builders can create and manage extensive surveys that include a wide range of functionality such as branching logic, 12+ question types (audio, video, card sort, matrix, custom response sets with autocomplete), validated instrument and measure libraries, versioning system, and more.","technologies":["React",".NET","AWS"],"color":"teal","imageUrl":""},{"slug":"research","displayName":"Luna Research Workbench","link":"https://workbench.lunadna.com","description":"Luna Workbench is a research sandbox for Community Researchers to explore and analyze their Luna Members' data. Researchers can choose how to view and analyze the data with options like Jupiter Notebook, Tableau, Amazon QuickSight and more.","technologies":["React",".NET","AWS"],"color":"teal","imageUrl":""}]}},"__N_SSG":true}